Revit 2027 API
StructuralSectionAnalysisParams.Perimeter Property
 Painting surface of the unit length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Perimeter { get; set; }
Public Property Perimeter As Double
	Get
	Set
public:
property double Perimeter {
	double get ();
	void set (double value);
}
member Perimeter : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace